package xxgc;
//企业发放的奖金根据利润提成。利润低于或等于 100000 元的，奖金可提 10%;
//        利润高于 100000 元，低于 200000 元（100000<I≤200000）时，低于 100000 元
//        的部分按 10％提成，高于 100000 元的部分，可提成 7.5%;
//        200000<I≤400000 时，低于 200000 元部分仍按上述办法提成，（下同），高于
//        200000 元的部分按 5％提成；
//        400000<I≤600000 元时，高于 400000 元的部分按 3％提成；
//        600000<I≤1000000 时，高于 600000 元的部分按 1.5%提成；
//        I>1000000 时，超过 1000000 元的部分按 1%提成。从键盘输入当月利润 I,求应发
//        奖金总数。
public class tip9 {
    public static void main(String[] args) {

    }
}
